package ru.avalon.java.dev.j10.labs.models;

/**
 * Представление о паспортных данных человека.
 * 
 * Паспортные данные должны включать:
 *  - серию и номер документа;
 *  - имя;
 *  - фамилию;
 *  - отчество;
 *  - второе имя;
 *  - день рождения;
 *  - дату выдачи;
 *  - орган, выдавший документ.
 * 
 */
class Passport {

    /*
     * TODO(Студент): Закончить определение класса.
     *
     * 1. Объявить атрибуты класса.
     *
     * 2. Определить необходимые методы класса. Подумайте о
     *    том, какие методы должны существовать в классе,
     *    чтобы обеспечивать получение всей необходимой
     *    информации о состоянии объектов данного класса.
     *    Все ли поля обязательно будут проинициализированы
     *    при создании экземпляра?
     *
     * 3. Создайте все необходимые конструкторы класса.
     *
     * 4. Помните о возможности существования перегруженных
     *    конструкторов.
     *
     * 5. Обеспечьте возможность использования класса за
     *    пределами пакета.
     */
    
    private String series;
    private int numPas;
    private String name;
    private String surName;
    private String fatherName;
}
